{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Dean Morgan",
  "language": "en",
  "home_page_url": "https://deanmorgan.me/",
  "feed_url": "https://deanmorgan.me/feed/feed.json",
  "description": "A personal blog site built with eleventy and hosted on github pages.",
  "author": {
    "name": "Dean James Morgan",
    "url": "https://deanmorgan.me/about-me/"
  },
  "items": [{
      "id": "https://deanmorgan.me/posts/01-falling-at-the-first-hurdle/",
      "url": "https://deanmorgan.me/posts/01-falling-at-the-first-hurdle/",
      "title": "Falling at the first hurdle",
      "content_html": "<p>I've already fallen at the first hurdle with this site. I started to build it back in May and everything was going well. I had all the best intentions to keep developing it, but then life threw me a curveball that I hadn't prepared for and that changed everything.</p>\n<p>Not long after I had started building this website, I decided that I was going to be leaving my role as a Frontend Developer at Flavour Warehouse and move on to a new role at <a href=\"https://www.pinpointdesigns.co.uk/\">Pinpoint</a>, one of the leading Magento 2 agencies in the UK. During the job transition this site got put on the shelf as I wanted to make sure that a) all the work I had done at Flavour Warehouse had been properly documented and handed over to the relevant parties and b) I wanted to make sure I could hit the ground running with my new position at Pinpoint.</p>\n<p>Now I've settled in at Pinpoint, I fired this project back up and suddenly realised that the time that I had spent away from it was enough for me to lose track of where I was at. I am going to need to re-learn some of the things I had already learned previously.</p>\n<p>Rather than juggling lots of projects, I have always tended to focus on one at a time. However, now that I've started working for an agency, I've realised that this isn't a luxury I have anymore and I often find myself swapping between projects on a daily basis. With that in mind, I am also hoping to try and adopt that into my personal projects now and rather than spend weeks on each project at once, break it down and do smaller bits on each in rotation.</p>\n<p>The other thing I can do to help myself better manage projects would be to improve the way I am documenting my work. So going forwards, I am going to try and make sure that I leave enough time to document everything I have been doing so that if there is ever a long period of time between sessions of work, I should be able to read through the docs and be back up to speed much easier. This will no doubt take some getting used to, but again it is a valueable skillset to have, especially when working in an agency setting.</p>\n<p>This probably isn't the most helpful or entertaining of blog posts for anyone who stumbles across it, but for me it will serve as a reminder of how I should be making adjustments to my approach so that I can improve.</p>\n<p>Let's see how it goes...</p>\n",
      "date_published": "2021-10-14T00:00:00Z"
    }
  ]
}
